<template>
  <v-card>
    <v-card-text>
      <div class="d-md-flex justify-content-end">
        <v-btn class="success mx-0">
          <v-icon color="white" small>mdi-plus</v-icon>
          پست جدید
        </v-btn>

      </div>
      <div v-for="(post,index) in posts"
           :key="index">
        <post :data="post"/>

      </div>
    </v-card-text>
  </v-card>
</template>

<script>
    import Post from '~/components/Content/Post.vue'
    export default {
        components: {Post},
        name: "wall",
        data() {
          return {
            posts: [
              {
                title: 'آری اینچنین بود ای برادر',
                text: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.',
                date: '23:23 2018/5/12 ',
                owner: {
                  name: 'سید عارف حسینی کیا'
                }
              },
              {
                title: 'آری اینچنین بود ای برادر',
                text: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.',
                date: '23:23 2018/5/12 ',
                owner: {
                  name: 'سید عارف حسینی کیا'
                }
              }
            ]
          }
        },
    }
</script>

<style scoped>

</style>
