<template>
  <wall :user="user"></wall>
</template>

<script>
  import Wall from "~/components/Content/Wall";
  export default {
    name: "_slug",
    layout: 'content',
    components: {Wall},
    computed: {
      user(){
        let user = {
          username: '9331009',
          name: 'امیر حقیقتی ملکی',
          posts: [
            {
              _id: '_dummy_id',
              title: 'آری اینچنین بود ای برادر',
              body: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.',
              date: new Date(),
              approved: true,
              user: {
                id: '_dummydata',
                username: '9331001',
                name: 'ایمان تبریزیان'
              },
            },
            {
              _id: '_dummy_id',
              title: 'آری اینچنین بود ای برادر',
              body: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.',
              date: new Date(),
              approved: false,
              user: {
                id: '_dummydata',
                username: '9331009',
                name: 'امیر حقیقتی ملکی'
              }
            },
          ]
        }
        console.log("USER DONE:")
        console.log(user)
        return user
      }
    },
    mounted() {
      this.$vuetify.goTo('#tabs', {
        duration: 300,
        offset: -100,
        easing: 'easeInOutCubic'
      })
    },
    //TODO: remove this
    fetch ({ store, redirect }) {
      return redirect('/landing')
    },
  }
</script>

<style scoped>

</style>
